Revit 2022 API
UnitGroup Enumeration
 A group of related unit types, primarily classified by discipline.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
Since: 2014
Since: 2014
Syntax
C#
[ObsoleteAttribute("This enumeration is deprecated in Revit 2022 and may be removed in a future version of Revit. Please use the `ForgeTypeId` class instead. Use constant members of the `DisciplineTypeId` class to replace uses of specific values of this enumeration.")]
public enum UnitGroup
Visual Basic
<ObsoleteAttribute("This enumeration is deprecated in Revit 2022 and may be removed in a future version of Revit. Please use the `ForgeTypeId` class instead. Use constant members of the `DisciplineTypeId` class to replace uses of specific values of this enumeration.")> _
Public Enumeration UnitGroup
Visual C++
[ObsoleteAttribute(L"This enumeration is deprecated in Revit 2022 and may be removed in a future version of Revit. Please use the `ForgeTypeId` class instead. Use constant members of the `DisciplineTypeId` class to replace uses of specific values of this enumeration.")]
public enum class UnitGroup
Members
Member name | Description
Common |  Common
Structural |  Structural
HVAC |  HVAC
Electrical |  Electrical
Piping |  Piping
Energy |  Energy
Infrastructure |  Infrastructure
See Also
Autodesk.Revit.DB Namespace